/*
 * TINYEXPR - Tiny recursive descent GLSL parser and evaluation engine in C
 *
 * Copyright (c) 2015-2020 Lewis Van Winkle
 *
 * http://CodePlea.com
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 * claim that you wrote the original software. If you use this software
 * in a product, an acknowledgement in the product documentation would be
 * appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 * misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 */

#ifndef TESL_HPP
#define TESL_HPP

#include <cmath>
#include <climits>
#include <cstring>
#include <cstdint>
#include <cstdio>

#include <type_traits>
#include <utility>

//#define TE_DEBUG_PEDANTIC
#define TE_DEBUG_COMPILE
#define TE_DEBUG_EVAL
#define TE_DEBUG_EXPR
#define TE_MAX_VAR_COUNT 128
#define TE_MAX_STMT_COUNT 256

#define TE_TYPE_MASK_BIT_COUNT 7

#define TE_PARAM_COUNT_MAX (22)

#define TE_TYPE_COUNT_MAX (1ul << TE_TYPE_MASK_BIT_COUNT)

enum te_type : uint8_t {
  TE_ERROR = 0,
  TE_FLOAT_REF,
  TE_VEC2_REF,
  TE_VEC3_REF,
  TE_VEC4_REF,
  TE_INT_REF,
  TE_MAT2_REF,
  TE_MAT3_REF,
  TE_MAT4_REF,
  TE_STR_REF,
  TE_FUNCTION,
  TE_TYPE_COUNT,

  TE_CONSTANT = 1ul << 7,
  TE_FLAG_PURE = TE_CONSTANT,
  TE_PURE_FUNCTION = TE_FUNCTION | TE_FLAG_PURE,

  TE_NULL = TE_CONSTANT,
  TE_FLOAT = TE_FLOAT_REF | TE_CONSTANT,
  TE_VEC2 = TE_VEC2_REF | TE_CONSTANT,
  TE_VEC3 = TE_VEC3_REF | TE_CONSTANT,
  TE_VEC4 = TE_VEC4_REF | TE_CONSTANT,
  TE_INT = TE_INT_REF | TE_CONSTANT,
  TE_MAT2 = TE_MAT2_REF | TE_CONSTANT,
  TE_MAT3 = TE_MAT3_REF | TE_CONSTANT,
  TE_MAT4 = TE_MAT4_REF | TE_CONSTANT,
  TE_STR = TE_STR_REF | TE_CONSTANT,
};

enum te_opcode : uint8_t {
  TE_OP_JMP,
  TE_OP_JMP_REF,
  TE_OP_JMP_IF,
  TE_OP_JMP_IF_NOT,
  TE_OP_RETURN,
  TE_OP_VALUE,
  TE_OP_DEREF,
  TE_OP_FUNCTION,
  TE_OP_SUITE,
  TE_OP_STACK_REF,
  TE_OP_ASSIGN,
};

static_assert(sizeof(float) == 4);
static_assert(TE_TYPE_COUNT <= TE_TYPE_COUNT_MAX);

#define TE_IS_FUNCTION(TYPE) (((TYPE) & ~TE_FLAG_PURE) == TE_FUNCTION)
#define TE_IS_CONSTANT(TYPE) (((TYPE) & (TE_CONSTANT)) && !TE_IS_FUNCTION(TYPE))
#define TE_IS_REF(TYPE) (!((TYPE) & (TE_CONSTANT)) && !TE_IS_FUNCTION(TYPE))

struct te_vec2 {
  union {
    float elements[2]{0.0f};
    float arr[2];
    struct { float x, y; };
    struct { float r, g; };
  };
};

struct te_vec3 {
  union {
    float elements[3]{0.0f};
    float arr[3];
    struct { float x, y, z; };
    struct { float r, g, b; };
  };
};

struct te_vec4 {
  union {
    float elements[4] = {0.0f};
    float arr[4];
    struct { float x, y, z, w; };
    struct { float r, g, b, a; };
  };
};

union te_mat2 {
  float elements[2 * 2];
  te_vec2 arr[2]{};
};

union te_mat3 {
  float elements[3 * 3];
  te_vec3 arr[3]{};
};

union te_mat4 {
  float elements[4 * 4];
  te_vec4 arr[4]{};
};

struct te_string {
  const char * ptr = "<uninitialized-str>";
  int32_t length = strlen(ptr);

  te_string(const char * str, const int32_t p_length) {
    ptr = str;
    length = p_length;
  }

  explicit te_string(const char * str) {
    ptr = str;
    length = strlen(str);
  }
};

static_assert(sizeof(void *) == 4, "made for 32bit :/ srry didnt have the energy to um yea");

inline void te_noop(void * context, void * args, void * ret) {}

typedef void (* te_function)(void * context, void * args, void * ret);

struct te_expr;

struct te_fn_obj {
  te_function ptr = nullptr;
  void * context = nullptr;
  te_type return_type = TE_ERROR;
  int8_t param_count = 0;
  te_type param_types[TE_PARAM_COUNT_MAX]{TE_ERROR};

  [[nodiscard]] bool is_valid() const {
    return ptr != nullptr;
  }
};
static_assert(sizeof(te_fn_obj) == 32);

struct te_fn_obj_with_args : te_fn_obj {
  te_expr * args[1];

  te_fn_obj_with_args & operator=(const te_fn_obj &other) {
    ptr = other.ptr;
    context = other.context;
    return_type = other.return_type;
    param_count = other.param_count;
    for (int i = 0; i < param_count; ++i) {
      param_types[i] = other.param_types[i];
    }
    return *this;
  }
};

struct te_value {
  union {
    te_fn_obj fn;

    struct { float x, y, z, w; };
    struct { float r, g, b, a; };
    float float_;
    te_vec2 vec2;
    te_vec3 vec3;
    te_vec4 vec4;
    int32_t int_;
    te_mat2 mat2;
    te_mat3 mat3;
    te_mat4 mat4;
    te_string str;
    float elements[16];

    void * ptr;
    te_value * ref;
    float * float_ref;
    te_vec2 * vec2_ref;
    te_vec3 * vec3_ref;
    te_vec4 * vec4_ref;
    int32_t * int_ref;
    te_mat2 * mat2_ref;
    te_mat3 * mat3_ref;
    te_mat4 * mat4_ref;
    te_string * str_ref;
  };

  te_value() {
    static_assert(sizeof(te_value) == 64);
    memset(this, 0, 64);
  };

  te_value(te_fn_obj p_fn) : fn(p_fn) {};
  te_value(float p_float) : float_(p_float) {};
  te_value(int32_t p_int) : int_(p_int) {};
  te_value(te_vec2 p_vec) : vec2(p_vec) {};
  te_value(te_vec3 p_vec) : vec3(p_vec) {};
  te_value(te_vec4 p_vec) : vec4(p_vec) {};
  te_value(te_mat2 p_vec) : mat2(p_vec) {};
  te_value(te_mat3 p_vec) : mat3(p_vec) {};
  te_value(te_mat4 p_vec) : mat4(p_vec) {};

  te_value(void * p_ptr) : ptr(p_ptr) {};
  te_value(te_value * p_ref) : ref(p_ref) {};
};

struct te_variable {
  const char * name = "<unnamed>";
  te_type type = TE_ERROR;
  union {
    te_value value;
    te_fn_obj fn;
  };
};

// DO NOT STATICALLY ALLOCATE EXPR OBJS
struct te_expr {
  te_opcode opcode = TE_OP_VALUE;
  te_type type = TE_ERROR;
  union {
    uint16_t offset = 0;
    uint16_t size;
  };
  union {
    te_value value;
    te_fn_obj_with_args fn;
    te_expr * opargs[1];
  };
};
static_assert((sizeof(te_opcode) + sizeof(te_type) + sizeof(uint16_t)) == 4);
static_assert(sizeof(te_expr) == (1 + 1 + 2 + 64));

inline te_type te_expr_result_type(const te_expr * expr) {
  if (!expr) {
    return TE_ERROR;
  } else if (expr->opcode == TE_OP_STACK_REF) {
    // always yields a ref
    return te_type(expr->type & ~TE_CONSTANT);
  } else if (expr->opcode == TE_OP_FUNCTION) {
    return expr->fn.return_type;
  } else {
    return expr->type;
  }
}

/* Parses the input expression, evaluates it, and frees it. */
/* result_type is TE_ERROR on error. */
te_value te_interp(const char * expression, te_type * result_type, int * error = nullptr);

/* Parses the input expression and binds variables. */
/* Returns nullptr on error. */
te_expr * te_compile(const char * expression, const te_variable * variables, int var_count, int * error = nullptr);

/* Evaluates the expression. */
te_value te_eval(const te_expr * n);

